{
  "easy": [
    {
      "ques": "How can a clear object be transparent and visible at the same time ?",
      "subject": "physics",
      "topic": "Ray Optics",
      "marks": "2"
    },
    {
      "ques": "How can a material at a certain temperature have all of its molecules at the same energy ?",
      "subject": "physics",
      "topic": "Thermodynamics",
      "marks": "2"
    },
    {
      "ques": "Light has no mass so it also has no energy according to Einstein, but how can sunlight warm the earth without energy ?",
      "subject": "physics",
      "topic": "Wave Optics",
      "marks": "2"
    },
    {
      "ques": "What did Schrodinger's Cat experiment prove ?",
      "subject": "physics",
      "topic": "Dual Nature of Radiation and Matter",
      "marks": "2"
    },
    {
      "ques": "What is the speed of dark ?",
      "subject": "physics",
      "topic": "Ray Optics",
      "marks": "2"
    },
    {
      "ques": "When does light travel in a straight line ?",
      "subject": "physics",
      "topic": "Ray Optics",
      "marks": "2"
    },
    {
      "ques": "Why are all metals magnetic ?",
      "subject": "physics",
      "topic": "Magnetism and Matter",
      "marks": "2"
    },
    {
      "ques": "Why is the centrifugal force talked about so much if it's not real ?",
      "subject": "physics",
      "topic": "Rotational Motion",
      "marks": "2"
    },
    {
      "ques": "Why will a delivery truck filled with birds sitting on its floor be heavier than a truck with the same birds flying around inside ?",
      "subject": "physics",
      "topic": "Work, Enery and Power",
      "marks": "2"
    },
    {
      "ques": "When does a light beam have only a single frequency ?",
      "subject": "physics",
      "topic": "Ray Optics",
      "marks": "2"
    },
    {
      "ques": "Calculate the total number of angular nodes and radial nodes present in the 3p orbital.",
      "subject": "chemistry",
      "topic": "Structure of Atom",
      "marks": "2"
    },
    {
      "ques": "The electronic configuration of the valence shell of Cu is 3d10 4s1 and not 3d9 4s2. How is this configuration explained ?",
      "subject": "chemistry",
      "topic": "Structure of Atom",
      "marks": "2"
    },
    {
      "ques": "How do you account for the strong reducing power of lithium in aqueous solution ?",
      "subject": "chemistry",
      "topic": "s-Block Elements",
      "marks": "2"
    },
    {
      "ques": "Why carbon has a strong tendency for catenation compared to silicon ?",
      "subject": "chemistry",
      "topic": "p-Block Elements",
      "marks": "2"
    },
    {
      "ques": "Under what conditions a real gas would behave ideally and Why ?",
      "subject": "chemistry",
      "topic": "State of Matter",
      "marks": "2"
    },
    {
      "ques": "Name the classes of hydrides to which H2O, B2H6, and NaH belong.",
      "subject": "chemistry",
      "topic": "Hydrogen",
      "marks": "2"
    },
    {
      "ques": "Greenhouse effect leads to global warming. Which substances are responsible for greenhouse effect?",
      "subject": "chemistry",
      "topic": "Environmental Chemistry",
      "marks": "2"
    },
    {
      "ques": "On the basis of chemical reactions involved, explain how de chlorofluorocarbons cause thinning of the ozone layer in the stratosphere.",
      "subject": "chemistry",
      "topic": "Environmental Chemistry",
      "marks": "2"
    },
    {
      "ques": "At 298 K. Kp for the reaction N2O4 (g) ⇄ 2NO2 (g) is 0.98. Predict whether the reaction is spontaneous or not.",
      "subject": "chemistry",
      "topic": "Chemical Thermodynamics",
      "marks": "2"
    },
    {
      "ques": "The pH of 0.08 mol dm-3 HOCl solution is 2.85. Calculate its ionisation constant.",
      "subject": "chemistry",
      "topic": "Equilibrium",
      "marks": "2"
    },
    {
      "ques": "Let f(x) = x2 and g(x) = 2x + 1 be two real functions. Find (f + g) (x), (f –g) (x), (fg) (x), (f/g ) (x)",
      "subject": "maths",
      "topic": "Relations and Functions",
      "marks": "2"
    },
    {
      "ques": "In any triangle ABC, prove that a sin (B – C) + b sin (C – A) + c sin (A – B) = 0.",
      "subject": "maths",
      "topic": "Trigonometric Functions",
      "marks": "2"
    },
    {
      "ques": "Show that tan 3x tan 2x tan x = tan 3x – tan 2x – tan x.",
      "subject": "maths",
      "topic": "Trigonometric Functions",
      "marks": "2"
    },
    {
      "ques": "The sums of n terms of two arithmetic progressions are in the ratio 5n+4: 9n+6. Find the ratio of their 18th terms.",
      "subject": "maths",
      "topic": "Sequences and Series",
      "marks": "2"
    },
    {
      "ques": "Show that the sum of (m + n)th and (m – n)th terms of an A.P. is equal to twice the mth term.",
      "subject": "maths",
      "topic": "Sequences and Series",
      "marks": "2"
    },
    {
      "ques": "Using the binomial theorem, show that 6n–5n always leaves remainder 1 when divided by 25.",
      "subject": "maths",
      "topic": "Binomial Theorem",
      "marks": "2"
    },
    {
      "ques": "Find the variance and the standard deviation for the following data: 57, 64, 43, 67, 49, 59, 44, 47, 61, 59.",
      "subject": "maths",
      "topic": "Statistics",
      "marks": "2"
    },
    {
      "ques": "The mean of 2, 7, 4, 6, 8 and p is 7. Find the mean deviation about the median of these observations.",
      "subject": "maths",
      "topic": "Statistics",
      "marks": "2"
    },
    {
      "ques": "For any two complex numbers z1 and z2, show that Re(z1z2) = Rez1*Rez2– Imz1*Imz2",
      "subject": "maths",
      "topic": "Complex Numbers and Quadratic Equations",
      "marks": "2"
    },
    {
      "ques": "A die is rolled. Let E be the event “die shows 4” and F be the event “die shows even number”. Are E and F mutually exclusive?",
      "subject": "maths",
      "topic": "Probability",
      "marks": "2"
    }
  ],

 "medium" : [
    {
      "ques": "Consider a scenario of a coin. It is naturally electrically neutral and contains equal amounts of the negative and positive charge of magnitude 34.8 kC. Suppose that these equal charges were concentrated in two point charges separated by (i) 1 cm (∼ 1⁄2 diagonal of the one paisa coin), (ii) 100 m (∼ length of along building), and (iii) 106 m (radius of the Earth). Find the force on each such point charge in each of the three cases. What do you conclude from these results ?",
      "subject": "physics",
      "topic": "Electric Charges and Fields",
      "marks": "3"
    },
    {
      "ques": " Calculate potential on the axis of a ring due to charge Q uniformly distributed along the ring of radius R.",
      "subject": "physics",
      "topic": "Electrostatic Potential and Capacitance",
      "marks": "3"
    },
    {
      "ques": "For the same objective, find the ratio of the least separation between two points to be distinguished by a microscope for light of 5000 A and electrons accelerated through 100V used as the iluminating substance.",
      "subject": "physics",
      "topic": "Wave Optics",
      "marks": "3"
    },
    {
      "ques": " Imagine yourself in a spacecraft in circular orbit, well behind a space station in the same orbit. You intend to dock with the space station. How can it be done? Explain.",
      "subject": "physics",
      "topic": "Gravitation",
      "marks": "3"
    },
    {
      "ques": "A person sitting in an artificial satellite of earth feels weightlessness, but a person standing on the moon has weight, do the moon is also a satellite of Earth?",
      "subject": "physics",
      "topic": "Gravitation",
      "marks": "3"
    },
    {
      "ques": "Is it possible for a ship to utilise the internal energy of sea water to operate its engine? Give reason too.",
      "subject": "physics",
      "topic": "Thermodynamics",
      "marks": "3"
    },
    {
      "ques": "An electric refrigerator transfers heat from a colder region to warmer surroundings. Does it not violate the second law of thermodynamics? Comment.",
      "subject": "physics",
      "topic": "Thermodynamics",
      "marks": "3"
    },
    {
      "ques": "Why is a restoring force must for an object to execute simple harmonic motion?",
      "subject": "physics",
      "topic": "Oscillations",
      "marks": "3"
    },
    {
      "ques": "Hot water bottles are used for hot fomentation. Why?",
      "subject": "physics",
      "topic": "Thermal Properties of Matter",
      "marks": "3"
    },
    {
      "ques": "A certain mass of gas is enclosed in a container. When temperature of the gas is raised, its pressure rises. How will you explain this on the basis of kinetic theory of gases?",
      "subject": "physics",
      "topic": "Kinetic Theory",
      "marks": "3"
    },
    {
      "ques": "P4O6 reacts with water according to the equation P4O6 + 6H2O → 4H3PO3. Calculate the volume of 0.1MNaOH solution required to neutralise the acid formed by dissolving 1.1g of P4O6 in H2O.",
      "subject": "chemistry",
      "topic": "The p-Block Elements",
      "marks": "3"
    },
    {
      "ques": "Why on dilution the Λm of CH3COOH increases drastically, while that of CH3COONa increases gradually?",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "3"
    },
    {
      "ques": "Explain Hardy-Schulze rule,based on that explain why the coagulating power of phosphate is higher than chloride.",
      "subject": "chemistry",
      "topic": "Surface Chemistry",
      "marks": "3"
    },
    {
      "ques": "Why do compounds having similar geometry have different magnetic moments ? Explain with example.",
      "subject": "chemistry",
      "topic": "Coordination Compounds",
      "marks": "3"
    },
    {
      "ques": "Explain the terms ideal and non-ideal solutions in the light of forces of interactions operating between molecules in liquid solutions.",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "3"
    },
    {
      "ques": "A solution of KMnO4 on reduction yields either a colourless solution or a brown precipitate or a green solution depending on pH of the solution. What different stages of the reduction do these represent and how are they carried out?",
      "subject": "chemistry",
      "topic": "D and F Block Elements.",
      "marks": "3"
    },
    {
      "ques": "Write two basic requirements for refining of a metal by Mond process and by Van Arkel Method.",
      "subject": "chemistry",
      "topic": "General Principles and Processes of Isolation of Elements",
      "marks": "3"
    },
    {
      "ques": " How can phenol be converted to aspirin ?",
      "subject": "chemistry",
      "topic": "Alcohols, Phenols and Ethers",
      "marks": "3"
    },
    {
      "ques": "A solution contains 1 g mol each of p-toluene diazonium chloride and p-nitrophenyl diazonium chloride. 1 g mol of an alkaline solution of phenol is added to this. Predict the major product. Explain your answer.",
      "subject": "chemistry",
      "topic": "Amines",
      "marks": "3"
    },
    {
      "ques": "What is the role of benzoyl peroxide in addition to the polymerisation of alkenes? Explain its mode of action with the help of an example.",
      "subject": "chemistry",
      "topic": "Polymers",
      "marks": "3"
    },
    {
      "ques": " If x2 + px – 444p = 0 has integral roots, where p is a prime number, then the value(s) of p is (are) ?",
      "subject": "maths",
      "topic": "Quadratic Equations",
      "marks": "3"
    },
    {
      "ques": " Let O be the centre of the circle x2 + y2 = r2, where r > √5/2 . Suppose PQ is a chord of this circle and the equation of the line passing through P and Q is 2x + 4y = 5. If the centre of the circumcircle of the triangle OPQ lies on the line x + 2y = 4, then the value of r is ?",
      "subject": "maths",
      "topic": "Circle",
      "marks": "3"
    },
    {
      "ques": "The total number of ways in which 5 balls of different colours can be distributed among 3 persons so that each person gets at least one ball is ?",
      "subject": "maths",
      "topic": "Permutation N Combination",
      "marks": "3"
    },
    {
      "ques": "Let the curve C be the mirror image of the parabola y2 = 4x with respect to the line x + y + 4 = 0. If A and B are the points of intersection of C with the line y = -5, then the distance between A and B is ?",
      "subject": "maths",
      "topic": "Parabola",
      "marks": "3"
    },
    {
      "ques": "Let PQ be a focal chord of the parabola y2 = 4ax. The tangents to the parabola at P and Q meet at a point lying on the line y = 2x + a, a>0. Length of the chord PQ is ?",
      "subject": "maths",
      "topic": "Parabola",
      "marks": "3"
    },
    {
      "ques": "If a function f is such that f(0) = 2, f(1) = 3, f(x+2) = 2f(x) – f(x+1) for x ≥ 0, then f(5) is equal to",
      "subject": "maths",
      "topic": "Continuity",
      "marks": "3"
    },
    {
      "ques": "If the perpendicular bisector of the line segment joining the points P(1, 4) and Q(k, 3) has y-intercept equal to -4, then a value of k is ?",
      "subject": "maths",
      "topic": "Straight Line",
      "marks": "3"
    }
  ],

 "hard" : [
    {
      "ques": "A solid sphere of mass 2 kg radius 0.5m is rolling with an initial speed of 1 ms-1 goes up an inclined plane which makes an angle of 300 with the horizontal plane, without slipping. How long will the sphere take to return to the starting point A?",
      "subject": "physics",
      "topic": "Rotational Dynamics",
      "marks": "5"
    },
    {
      "ques": "The time constant of an LR circuit is 20 ms. The circuit is connected at t = 0 and the steady-state current is found to be 4A. Find the current at 80 ms.",
      "subject": "physics",
      "topic": "Electromagnetic Induction",
      "marks": "5"
    },
    {
      "ques": "When M1 gram of ice at 10°C (specific heat = 0.5 cal g-10C-1) is added to M2 gram of water at 50°C, finally no ice is left and the water is at 0°C. The value of latent heat of ice, in calg-1 is ?",
      "subject": "physics",
      "topic": "Calirometry and Heat Transfer",
      "marks": "5"
    },
    {
      "ques": "An amorphous solid A burns in air to form a gas B which turns lime water milky. The gas is also produced as a by-product during the roasting of sulphide ore. This gas decolourises acidified aqueous KMnO4 solution and reduces Fe3+ to Fe2+. Identify the solid A and the gas B.",
      "subject": "chemistry",
      "topic": "The p-Block Elements",
      "marks": "5"
    },
    {
      "ques": "Define the terms specific conductance, molar conductance and equivalent conductance. Derive the relationship between molar conductance and equivalent conductance.",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "5"
    },
    {
      "ques": "How can you remove the hard calcium carbonate layer of the egg without damaging its semipermeable membrane? Can this egg be inserted into a bottle with a narrow neck without distorting its shape? Explain the process involved.",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "5"
    },
    {
      "ques": "When an oxide of manganese (A) is fused with KOH in the presence of an oxidising agent and dissolved in water, it gives a dark green solution of compound (B). Compound (B) disproportionates in neutral or acidic solution to give purple compound (C). An alkaline solution of compound (C) oxidises potassium iodide solution to a compound (D) and compound (A) is also formed. Identify compounds A to D and also explain the reactions involved.",
      "subject": "chemistry",
      "topic": "D and F Block Elements.",
      "marks": "5"
    },
    {
      "ques": "Explain a process in which a biocatalyst is used in industrial preparation of a compound known to you.",
      "subject": "chemistry",
      "topic": "Alcohols, Phenols and Ethers",
      "marks": "5"
    },
    {
      "ques": "A colourless substance ‘A’ (C6H7N) is sparingly soluble in water and gives a water-soluble compound ‘B’ on treatment with mineral acid. On reacting with CHCI3 and alcoholic potash, ‘A’ produces an obnoxious smell due to compound ‘C’ formation. The reaction of ‘A’ with benzene sulphonyl chloride gives compound ‘D’, which is soluble in alkali. With NaNO2 and HCI, ‘A’ forms compound ‘E’, which reacts with phenol in an alkaline medium to give’ F’ orange dye. Identify compounds ‘A’ to ‘F’.",
      "subject": "chemistry",
      "topic": "Amines",
      "marks": "5"
    },
    {
      "ques": "Synthetic detergents have an advantage over usual soaps as far as cleansing power is concerned. But the use of synthetic detergents over a long time creates environmental pollution. How can the pollution caused by synthetic detergents be minimised? Classify the detergents according to their chemical nature.",
      "subject": "chemistry",
      "topic": "Chemistry in Everyday Life",
      "marks": "5"
    },
    {
      "ques": "A value of b for which the equations x2 + bx – 1 = 0 and x2 + x + b = 0 have one root in common is ?",
      "subject": "maths",
      "topic": "Quadratic Equations",
      "marks": "5"
    },
    {
      "ques": "A debate club consists of 6 girls and 4 boys. A team of 4 members is said to be selected from this club including the selection of a captain (from among these 4 members) for the team. If the team has to be included at most one boy, then the number of ways of selecting the team is ?",
      "subject": "maths",
      "topic": "Permutation N Combination",
      "marks": "5"
    },
    {
      "ques": "If λx2 – 5xy + 6y2 + x – 3y = 0 represents a pair of straight lines, then their point of intersection is",
      "subject": "maths",
      "topic": "Straight Line",
      "marks": "5"
    },
    {
      "ques": "The equation x2 – 3xy + λy2 + 3x – 5y + 2 = 0 when λ is a real number, represents a pair of straight lines. If θ is the angle between the lines, then cosec2 θ is equal to ?",
      "subject": "maths",
      "topic": "Straight Line",
      "marks": "5"
    }
  ]
}