{
  "easy": [
    {
      "ques": "Explain the concept of moment of inertia.",
      "subject": "physics",
      "topic": "Motion",
      "marks": "2"
    },
    {
      "ques": "Explain the procedure to determine the coefficient of apparent expansion of a liquid using a specific gravity bottle with relevant theory.",
      "subject": "physics",
      "topic": "Thermal Properties of Liquids",
      "marks": "2"
    },
    {
      "ques": "A lorry and a car with the same kinetic energy are brought to rest by the application of brakes which provides equal retarding forces. Which of them will come to rest at a shorter distance ?",
      "subject": "physics",
      "topic": "Work, Energy and Power",
      "marks": "2"
    },
    {
      "ques": "A ring disc and a sphere, all the same radius and mass roll down an inclined plane from the same height h. Which of the three reaches the bottom (i) earliest (ii) latest ?",
      "subject": "physics",
      "topic": "Rotational Dynamics",
      "marks": "2"
    },
    {
      "ques": "A bullet of mass m is fired from a gun of mass M. If the muzzle speed of the bullet is V, then what is the recoiling speed of the gun ?",
      "subject": "physics",
      "topic": "Work, Energy and Power",
      "marks": "2"
    },
    {
      "ques": "Show that the centre of mass of a system of two particles lies on the straight line joining them.",
      "subject": "physics",
      "topic": "Rotational Dynamics",
      "marks": "2"
    },
    {
      "ques": "What is the binding energy of a satellite ?",
      "subject": "physics",
      "topic": "Gravitation",
      "marks": "2"
    },
    {
      "ques": "A rocket is fired from the Earth towards the sun. At what distance from the Earth’s centre is the gravitational force on the rocket zero ?",
      "subject": "physics",
      "topic": "Gravitation",
      "marks": "2"
    },
    {
      "ques": "Calculate the moment of inertia about the diameter if that of an axis perpendicular to the plane of a disc and passing through its centre given by 1/2MR2.",
      "subject": "physics",
      "topic": "rotational Dynamics",
      "marks": "2"
    },
    {
      "ques": "When does a light beam have only a single frequency ?",
      "subject": "physics",
      "topic": "Ray Optics",
      "marks": "2"
    },
    {
      "ques": "An aqueous solution of sodium chloride freezes below 273 K. Explain the lowering in freezing points of water with the help of a suitable diagram.",
      "subject": "chemistry",
      "topic": "Solid State",
      "marks": "2"
    },
    {
      "ques": "The conductivity of 0.001 M acetic acid is 4 x 10-5 S/cm. Calculate the dissociation constant of acetic acid, if molar conductivity at infinite dilution for acetic acid is 390 S cm2/mol.",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "2"
    },
    {
      "ques": "What is Lanthanoid contraction? What are its two consequences ?",
      "subject": "chemistry",
      "topic": "d & f-Block Elements",
      "marks": "2"
    },
    {
      "ques": "The standard electrode potential for the Daniell cell is 1.1 V. Calculate the standard Gibbs energy for the cell reaction. (F = 96500 C mol-1)",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "2"
    },
    {
      "ques": "Explain Cationic detergents with suitable examples.",
      "subject": "chemistry",
      "topic": "General Principles and Processes of Isolation of Elements",
      "marks": "2"
    },
    {
      "ques": "An element occurs in bcc structure. It has a cell edge length of 250 pm. Calculate the molar mass if its density is 8.0 g cm-3. Also, calculate the radius of an atom of this element.",
      "subject": "chemistry",
      "topic": "Solid State",
      "marks": "2"
    },
    {
      "ques": "Greenhouse effect leads to global warming. Which substances are responsible for greenhouse effect?",
      "subject": "chemistry",
      "topic": "Environmental Chemistry",
      "marks": "2"
    },
    {
      "ques": "Write the name of the cell which is generally used in hearing aids. Write the reactions taking place at the anode and the cathode of this cell.",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "2"
    },
    {
      "ques": "Write the chemical equations involved in the Kolbe’s reaction and Friedal-Crafts acetylation of anisole.",
      "subject": "chemistry",
      "topic": "Aldehydes, Ketones and Carboxylic Acids",
      "marks": "2"
    },
    {
      "ques": "Calculate the time to deposit 1.5 g of silver at cathode when a current of 1.5 A was passed through the solution of AgNO3. (Molar mass of Ag = 108 g mol-1, 1 F = 96500 C mol-1).",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "2"
    },
    {
      "ques": "Prove  that  2n > n  for  all  positive  integers  n  by  the  Principle  of  Mathematical  Induction",
      "subject": "maths",
      "topic": "Principle of Mathematical Induction",
      "marks": "2"
    },
    {
      "ques": "In any triangle ABC, prove the Cosine rule.",
      "subject": "maths",
      "topic": "Trigonometric Functions",
      "marks": "2"
    },
    {
      "ques": "Prove by induction that the sum of the cubes of three consecutive natural numbers is divisible by 9.",
      "subject": "maths",
      "topic": "Principle of Mathematical Induction",
      "marks": "2"
    },
    {
      "ques": "The sums of n terms of two arithmetic progressions are in the ratio 5n+4: 9n+6. Find the ratio of their 18th terms.",
      "subject": "maths",
      "topic": "Sequences and Series",
      "marks": "2"
    },
    {
      "ques": "Find the area bounded by the parabola y2 = 4ax, latus rectum and the x-axis.",
      "subject": "maths",
      "topic": "Parabola",
      "marks": "2"
    },
    {
      "ques": "Verify that the function y = a cos x + b sin x, where, a, b ∈ R is a solution of the differential equation d2y/dx2 + y=0.",
      "subject": "maths",
      "topic": "Differential Equations",
      "marks": "2"
    },
    {
      "ques": "Find the variance and the standard deviation for the following data: 57, 64, 83, 67, 61, 99.",
      "subject": "maths",
      "topic": "Statistics",
      "marks": "2"
    },
    {
      "ques": "Form the differential equation representing the family of curves y = a sin (x + b), where a, b are arbitrary constants.",
      "subject": "maths",
      "topic": "Differential Equations",
      "marks": "2"
    },
    {
      "ques": "For any two complex numbers z1 and z2, show that Re(z1z2) = Rez1*Rez2– Imz1*Imz2",
      "subject": "maths",
      "topic": "Complex Numbers and Quadratic Equations",
      "marks": "2"
    },
    {
      "ques": "A die is rolled. Let E be the event “die shows 4” and F be the event “die shows even number”. Are E and F mutually exclusive?",
      "subject": "maths",
      "topic": "Probability",
      "marks": "2"
    }
  ],

 "medium" : [
    {
      "ques": "Explain the two processes involved in the formation of a p-n junction diode.  Hence, define the term ‘barrier potential’.",
      "subject": "physics",
      "topic": "Semiconductors",
      "marks": "3"
    },
    {
      "ques": " State Gauss’s law in electrostatics. Derive an expression for the electric field due to an infinitely long straight uniformly changed wire.",
      "subject": "physics",
      "topic": "Electrostatic Potential and Capacitance",
      "marks": "3"
    },
    {
      "ques": "How many electrons must be added to one plate and removed from the other to store 25 J of energy in a 5.0 nF parallel plate capacitor ?",
      "subject": "physics",
      "topic": "Capacitors",
      "marks": "3"
    },
    {
      "ques": "State Lenz’s law.  Explain, by giving examples that Lenz’s law is a consequence of the conservation of energy.",
      "subject": "physics",
      "topic": "Magnetism",
      "marks": "3"
    },
    {
      "ques": "Draw a graph showing the variation of de Broglie wavelength of a particle of charge q and mass m with the accelerating potential. Proton and deuteron have the same de Broglie wavelength. Explain which has more kinetic energy.",
      "subject": "physics",
      "topic": "Dual Nature of Matter",
      "marks": "3"
    },
    {
      "ques": "State points to distinguish between skywave and space wave modes of propagation.",
      "subject": "physics",
      "topic": "Wave Optics",
      "marks": "3"
    },
    {
      "ques": "State Brewster’s law. The value of the Brewster’s angle for a transparent medium is different for the light of different colours. Give reason.",
      "subject": "physics",
      "topic": "Optics",
      "marks": "3"
    },
    {
      "ques": "Why is a restoring force must for an object to execute simple harmonic motion?",
      "subject": "physics",
      "topic": "Oscillations",
      "marks": "3"
    },
    {
      "ques": "Distinguish between ‘Intrinsic’ and ‘extrinsic’ semiconductors.",
      "subject": "physics",
      "topic": "Semiconductors",
      "marks": "3"
    },
    {
      "ques": "A certain mass of gas is enclosed in a container. When temperature of the gas is raised, its pressure rises. How will you explain this on the basis of kinetic theory of gases?",
      "subject": "physics",
      "topic": "Kinetic Theory",
      "marks": "3"
    },
    {
      "ques": "The partial pressure of ethane over a saturated solution containing 6.56 x 10-2 of ethane is 1 bar. If the solution were to contain 5.0 x 10-2 g of ethane, what will be the partial pressure of the gas.",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "3"
    },
    {
      "ques": "A first-order reaction takes 20 minutes for 25% decomposition. Calculate the time when 75% of the reaction will be completed. (Given : log 2 = 0·3010, log 3 = 0·4771, log 4 = 0·6021)",
      "subject": "chemistry",
      "topic": "Chemical Kinetics",
      "marks": "3"
    },
    {
      "ques": "Calculate the emf of the following cell at 25ºC Ag (s) | Ag+ (10-3 M) || Cu2+(10-1 M) | Cu (s) Given E°cell = +0.46 V and log10n = n",
      "subject": "chemistry",
      "topic": "Electrochemistry",
      "marks": "3"
    },
    {
      "ques": "Why do compounds having similar geometry have different magnetic moments ? Explain with example.",
      "subject": "chemistry",
      "topic": "Coordination Compounds",
      "marks": "3"
    },
    {
      "ques": "Define Nucleotide, Anomers and Essential amino acids",
      "subject": "chemistry",
      "topic": "Amines",
      "marks": "3"
    },
    {
      "ques": "What are emulsions?  What are their different types?  Give one example of each type.",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "3"
    },
    {
      "ques": "Write two basic requirements for refining of a metal by Mond process and by Van Arkel Method.",
      "subject": "chemistry",
      "topic": "General Principles and Processes of Isolation of Elements",
      "marks": "3"
    },
    {
      "ques": " The Vapour pressure of water at 20ºC is 17.5 mm Hg. Calculate the vapour pressure of water at 20ºC when 15 g of glucose (Molar mass = 180 g mol-1) is dissolved in 150 g of water.",
      "subject": "chemistry",
      "topic": "Solutions",
      "marks": "3"
    },
    {
      "ques": "Define adsorption with an example. Why is adsorption exothermic in nature? Write the types of adsorption based on the nature of forces between adsorbate and adsorbent.",
      "subject": "chemistry",
      "topic": "Surface Chemistry",
      "marks": "3"
    },
    {
      "ques": "What is the role of benzoyl peroxide in addition to the polymerisation of alkenes? Explain its mode of action with the help of an example.",
      "subject": "chemistry",
      "topic": "Polymers",
      "marks": "3"
    },
    {
      "ques": "Find  the area  enclosed  by  the  ellipse  x2/a2  +  y2/b2 = 1",
      "subject": "maths",
      "topic": "Applications of Integrals",
      "marks": "3"
    },
    {
      "ques": " Let O be the centre of the circle x2 + y2 = r2, where r > √5/2 . Suppose PQ is a chord of this circle and the equation of the line passing through P and Q is 2x + 4y = 5. If the centre of the circumcircle of the triangle OPQ lies on the line x + 2y = 4, then the value of r is ?",
      "subject": "maths",
      "topic": "Circle",
      "marks": "3"
    },
    {
      "ques": "An fair die is thrown double times. Assume that the event A is “odd number on the first throw” and B the event “odd number on the second throw”. Compare the independence of the events A and B.",
      "subject": "maths",
      "topic": "Probability",
      "marks": "3"
    },
    {
      "ques": "Let the curve C be the mirror image of the parabola y2 = 4x with respect to the line x + y + 4 = 0. If A and B are the points of intersection of C with the line y = -5, then find the points A and B ?",
      "subject": "maths",
      "topic": "Parabola",
      "marks": "3"
    },
    {
      "ques": "Find  the direction  cosines of the line passing through the two points (– 2, 4, – 5) and (1, 2, 3).",
      "subject": "maths",
      "topic": "3-D Geometry",
      "marks": "3"
    },
    {
      "ques": "The probability of solving the specific problem independently by the persons’ A and B are 1/2 and 1/3 respectively. In case, if both the persons try to solve the problem independently, then calculate the probability that the problem is solved.",
      "subject": "maths",
      "topic": "Probability",
      "marks": "3"
    },
    {
      "ques": "If the perpendicular bisector of the line segment joining the points P(1, 4) and Q(k, 3) has y-intercept equal to -4, then a value of k is ?",
      "subject": "maths",
      "topic": "Straight Line",
      "marks": "3"
    }
  ],

 "hard" : [
    {
      "ques": "Using Bohr’s postulates, derive the expression for the frequency of radiation emitted when an electron in a hydrogen atom undergoes the transition from a higher energy state quantum number ni) to the lower state (nf). When electron in hydrogen jumps from energy state ni = 4 to nr = 3,2,1, identify the spectral series to which the emission lines belong.",
      "subject": "physics",
      "topic": "Dual nature of matter",
      "marks": "5"
    },
    {
      "ques": "Draw a labelled diagram of the Van de Graaff generator. State its working principle to show how a large amount of charge can be transferred to the outer sphere by introducing a small charged sphere into a larger sphere. State the use of this machine and also point out its limitations.",
      "subject": "physics",
      "topic": "Electromagnetic Induction",
      "marks": "5"
    },
    {
      "ques": "A police jeep moving with a velocity of 45 kmph is chasing a thief who in another jeep is moving with a velocity of 153 kmph. A policeman fires a bullet with a muzzle velocity of 180 m/s. What is the velocity with which it will strike the thief’s car ?",
      "subject": "physics",
      "topic": "1-D Motion",
      "marks": "5"
    },
    {
      "ques": "Derive an expression for the loss in KE in a completely inelastic collision in one dimension.",
      "subject": "physics",
      "topic": "Work, Power and Energy",
      "marks": "5"
    },
    {
      "ques": "For the reaction NH4Cl s-> NH3 g + HCl g at 25°C, enthalpy change ΔH = +177 kJ mol-1 and entropy change ΔS = +285JK-1 mol-1 . Calculate the free energy change of ΔG at 25 C and predict whether the reaction is spontaneous or not.",
      "subject": "chemistry",
      "topic": "Thermodynamics",
      "marks": "5"
    },
    {
      "ques": "Compound ‘A’ with the molecular formula C5H8 reacts with hydrogen in the presence of Lindlar’s catalyst to form a compound B with the molecular formula C5 H10. A on reacting with sodium in liquid ammonia forms a compound ‘C’ with the same molecular formula as that of B. Identify ‘A’, ‘B’ and ‘C’. Give the chemical reactions involved.",
      "subject": "chemistry",
      "topic": "Alkanes",
      "marks": "5"
    },
    {
      "ques": "When an oxide of manganese (A) is fused with KOH in the presence of an oxidising agent and dissolved in water, it gives a dark green solution of compound (B). Compound (B) disproportionates in neutral or acidic solution to give purple compound (C). An alkaline solution of compound (C) oxidises potassium iodide solution to a compound (D) and compound (A) is also formed. Identify compounds A to D and also explain the reactions involved.",
      "subject": "chemistry",
      "topic": "D and F Block Elements.",
      "marks": "5"
    },
    {
      "ques": "Write the chemical reaction involved in Kolbe’s electrolytic process. What are the products formed at cathode and anode?",
      "subject": "chemistry",
      "topic": "Electrolysis",
      "marks": "5"
    },
    {
      "ques": "A colourless substance ‘A’ (C6H7N) is sparingly soluble in water and gives a water-soluble compound ‘B’ on treatment with mineral acid. On reacting with CHCI3 and alcoholic potash, ‘A’ produces an obnoxious smell due to compound ‘C’ formation. The reaction of ‘A’ with benzene sulphonyl chloride gives compound ‘D’, which is soluble in alkali. With NaNO2 and HCI, ‘A’ forms compound ‘E’, which reacts with phenol in an alkaline medium to give’ F’ orange dye. Identify compounds ‘A’ to ‘F’.",
      "subject": "chemistry",
      "topic": "Amines",
      "marks": "5"
    },
    {
      "ques": "Define the compressibility factor?  Explain how the function PV/RT (Z) can be used to show gases behave non-ideally at different pressures.",
      "subject": "chemistry",
      "topic": "Basic concepts of Chemistry",
      "marks": "5"
    },
    {
      "ques": "A die is thrown twice and the sum of the numbers rising is noted to be 6. Calculate the is the conditional probability that the number 4 has arrived at least once ?",
      "subject": "maths",
      "topic": "Probability",
      "marks": "5"
    },
    {
      "ques": "A debate club consists of 7 girls and 5 boys. A team of 5 members is said to be selected from this club including the selection of a captain (from among these 4 members) for the team. If the team has to be included at most one boy, then the number of ways of selecting the team is ?",
      "subject": "maths",
      "topic": "Permutation N Combination",
      "marks": "5"
    },
    {
      "ques": "The value of tan-1 √3 – sec-1(–2) is equal to ?",
      "subject": "maths",
      "topic": "Inverse Trigonometric Function",
      "marks": "5"
    },
    {
      "ques": "Find the equation of a curve passing through (1, π/4) if the slope of the tangent to the curve at any point P (x, y) is y/x – cos2(y/x).",
      "subject": "maths",
      "topic": "Differential Equations",
      "marks": "5"
    }
  ]
}
